words = ['вино', 'сука', 'срок', 'арка', 'тура', 'сова', 'жара',
         'день', 'жгут', 'урна', 'заяц', 'зона', 'звук', 'гора',
         'гусь', 'руна', 'суша', 'тара', 'враг', 'арба', 'кара',
         'поза', 'бобр', 'икра', 'слон', 'доза', 'знак', 'груз',
         'глаз', 'жаба', 'база', 'дока', 'губа', 'блин', 'жена',
         'доля', 'роса', 'бита', 'каюк', 'друг', 'вера', 'заря',
         'дыра', 'буря', 'дача', 'вода', 'кафр', 'дума', 'драп',
         'баян', 'суха', 'диво', 'грач', 'дочь', 'брат', 'дуга',
         'каюр', 'крюк', 'звон', 'пола', 'вата', 'град', 'банк',
         'рука', 'сока', 'урюк', 'иней', 'дека', 'борт', 'бокс',
         'сухо', 'мура', 'балл', 'врач', 'долг', 'урок', 'стон',
         'мука', 'азот', 'лука', 'кафе', 'жест', 'вход', 'волк',
         'муха', 'блок', 'гриф', 'жбан', 'двор', 'дело', 'зима',
         'ваза', 'рана', 'сток', 'змея', 'каре', 'горе', 'полк',
         'роза', 'арфа', 'игра']

def find_chain_words(words, start_word, end_word, chain=None):
    ...
    idx_start = words.index(start_word)
    idx_end = words.index(end_word)
    if start_word not in words or end_word not in words:
        return []
    word_set = set(words)


print(find_chain_words(start_word = 'муха',end_word = 'слон'))
TODO: Венруться после ООП